#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>  
#include <stdlib.h>  
#include <locale.h>
#include "funk.h"
#include <math.h>
#define M_PI            3.14159265358979323846
typedef double (*PFunc) (double, double, int, int*);
void main(void)
{
    setlocale(LC_ALL, "RUS");
    int number_mode;
    int fun, n;
    double temp1, temp2, count; 
    double x, eps; 
    PFunc func[4];
    func[0] = sinus;
    func[1] = cosinus;
    func[2] = expo;
    func[3] = arccos;
    printf("                            Для более удобного использования перейдите в полноэкранный режим\n");
    printf("----------------------------------------------------------------------------------------------------------------\n");
    printf("Выберите функцию, для которой нужно вычислить значение и введите соответствующую цифру\n");
    printf("----------------\n");
    printf("0. Sin(x)      |\n");
    printf("1. Cos(x)      |\n");
    printf("2. e^x(x)      |\n"); 
    printf("3. arccos(x)   |\n");
    printf("----------------\n");
    scanf_s("%d", &fun);
    printf("Для функция Sin и Cos необходимо вводить X в градусах! Для Arccos следует помнить, что аргумент X лежит в пределах от -1 до 1 включая эти числа!\n\n");
    printf("Введите точку x, в которой нужно вычислить значение функции \n\n");
    scanf_s("%lf", &x);
    printf("Введено число  %lf\n", x);
    printf("Выберите режим\n");
    printf("--------------------------------------------------------\n");
    printf("|1. Однократный расчет функции в заданной точке        |\n");
    printf("|2. Серийный экспиремнт                                |\n");
    printf("--------------------------------------------------------\n");
    scanf_s("%d", &number_mode);
    if (number_mode == 1)
    {
        printf("Задайте точность вычисления >= 0.000001\n");
        scanf_s("%lf", &eps);
        printf("Заданная точность   %lf\n", eps);
        printf("Задайте число элементов ряда от 1 до 1000\n");
        scanf_s("%d", &n);
        temp1 = func[fun](x, eps, n, &count);
        temp2 = math_meaning(fun, x);
        printf(" ----------------------------------------------------------------------\n");
        printf(" |             Значение функции = %.20lf                               \n", temp1);
        printf(" |---------------------------------------------------------------------\n");
        printf(" |             Эталонное значение = %.20lf                             \n", temp2);
        printf(" |---------------------------------------------------------------------\n ");
        printf("| Разница между найденным и эталонным значением = %.20lf              \n", inexactness(temp1, temp2));
        printf(" |---------------------------------------------------------------------\n ");
        printf("|          Количество посчитанных слогаемых = %d                      \n", count);
    }
    if (number_mode == 2)
    {
        eps = 0;
        printf("Задайте число элементов ряда от 1 до 25\n");
        scanf_s("%d", &n);
        {
            printf("                                    ------------------------------------------------------\n");
            printf("                                    |Эталонное значение %.20lf  \n", math_meaning(fun, x) );
            printf("                                    ------------------------------------------------------\n");

            printf("Номер экспиримента                           Полученное значение                                           Разница между оценкой и эталонным значением\n");
            printf("------------------------------------------------------------------------------------------------------------------------------------------------------------\n");
            func[fun](x, eps, n, &count);
        }
    }
    system("Pause");
}
