#include <stdio.h>
#include <locale.h>
#include <math.h>
#include <stdlib.h>
#include "header.h"

#define MAX_CHECK 100
#define TOVAR_COUNT 64
#define MAX_LENGTH 44

//названия товаров
char tovar_array[TOVAR_COUNT][MAX_LENGTH] = {
"Молоко ультрапастеризованное",
"Молоко безлактозное",
"Молоко детское с 8 месяцев",
"Кефир 3,2%",
"Кефир обезжиренный",
"Ряженка термостатная",
"Сливки 10%",
"Сливки 35% для взбивания",
"Сметана 15%",
"Сметана 25%",
"Молоко кокосовое",
"Молоко овсяное",
"Творог 9% жирности",
"Творожок детский сладкий",
"Яйцо диетическое",
"Масло сливочное крестьянское",
"Крупа гречневая ядрица",
"Крупа манная",
"Крупа пшено",
"Крупа перловая",
"Рис круглозерный",
"Рис длиннозерный",
"Бурый рис",
"Макароны спагетти ",
"Макароны вермишель",
"Макароны рожки",
"Макароны перья",
"Сахар песок белый",
"Сахар демерара коричневый",
"Сахар рафинад быстрорастворимый",
"Лапша гречневая",
"Фунчоза",
"Мука хлебопекарная в\\с",
"Мука блинная",
"Горох желтый колотый",
"Чечевица красная",
"Хлопья овсяные Геркулес",
"Хлопья 4 злака",
"Кукурузные хлопья с сахаром",
"Соль каменная помол №1",
"Соль поваренная Экстра",
"Крахмал картофельный",
"Сода пищевая",
"Чай черный индийский",
"Чай зеленый ",
"Кофе растворимый",
"Кофе в зернах ",
"Кофе молотый",
"Колбаса вареная докторская",
"Колбаса вареная любительская",
"Сервелат варенокопченый",
"Колбаса краковская",
"Сосиски молочные",
"Сосиски венские",
"Сосиски куриные",
"Сардельки",
"Колбаса сырокопченая салями",
"Бекон варенокопченый",
"Бекон сырокопченый",
"Грудинка копченая",
"Ветчина в оболочке",
"Паштет фермерский с грибами",
"Паштет из куриной печени",
"Колбаса ливерная ",
};

//цены товаров
int price_array[] = {
57,
75,
35,
75,
70,
50,
38,
220,
55,
70,
190,
85,
60,
30,
70,
90,
100,
49,
90,
80,
105,
115,
120,
50,
52,
47,
45,
38,
85,
44,
240,
350,
50,
65,
55,
120,
50,
70,
95,
15,
35,
90,
40,
180,
170,
330,
370,
180,
200,
195,
350,
180,
190,
230,
160,
180,
400,
470,
500,
400,
220,
170,
150,
350,
};

//штрих-коды товаров
short cods_array[TOVAR_COUNT][4] = {
{2, 0, 7, 5},
{9, 0, 0, 4},
{5, 4, 4, 4},
{2, 7, 3, 7},
{4, 4, 7, 7},
{2, 2, 4, 3},
{8, 0, 9, 7},
{5, 8, 1, 6},
{2, 3, 6, 8},
{3, 2, 2, 9},
{6, 7, 2, 0},
{2, 8, 8, 8},
{1, 2, 6, 1},
{8, 3, 9, 3},
{7, 9, 1, 9},
{4, 3, 6, 9},
{9, 1, 3, 2},
{2, 5, 7, 2},
{4, 2, 5, 4},
{4, 3, 6, 6},
{4, 5, 6, 1},
{7, 7, 5, 9},
{1, 4, 8, 2},
{6, 9, 1, 7},
{4, 8, 8, 5},
{3, 0, 5, 5},
{4, 1, 1, 8},
{5, 5, 2, 4},
{1, 7, 6, 3},
{2, 8, 1, 7},
{9, 0, 3, 1},
{2, 8, 3, 8},
{1, 8, 2, 1},
{4, 4, 7, 5},
{4, 5, 7, 6},
{5, 2, 9, 9},
{5, 7, 1, 9},
{2, 6, 7, 4},
{1, 1, 1, 5},
{7, 0, 8, 8},
{4, 9, 0, 3},
{6, 8, 3, 6},
{8, 9, 7, 6},
{5, 1, 6, 5},
{5, 2, 3, 0},
{6, 8, 9, 6},
{8, 5, 3, 4},
{4, 3, 6, 2},
{8, 4, 6, 8},
{2, 7, 8, 9},
{7, 7, 2, 9},
{3, 0, 2, 9},
{9, 5, 4, 8},
{8, 2, 1, 1},
{8, 9, 4, 7},
{4, 4, 3, 4},
{1, 2, 6, 6},
{3, 0, 6, 5},
{8, 9, 5, 8},
{2, 0, 3, 0},
{4, 8, 8, 2},
{7, 9, 9, 0},
{3, 8, 6, 9},
{5, 7, 0, 4},
};

//итоговый чек
short check[MAX_CHECK];

//напечатать информацию о товаре
void print_info(int index)
{
	if (index != -1)
		printf("%s: %d рублей/шт\n", tovar_array[index], price_array[index]);
}

//напечатать список товаров
void price_list(void)
{
	printf("Список доступной продукции:\n");
	for (int i = 0; i < TOVAR_COUNT; i++)
		printf("%d: %s - %d рублей\n" ,arr_to_int(cods_array[i]), tovar_array[i], price_array[i]);
}

//вернуть индекс из массива кодов
int check_update(int cod)
{
	for (int i = 0; i < TOVAR_COUNT; i++)
	{
		if (cod == arr_to_int(cods_array[i]))
			return i;
	}
	return -1;
}

//ввод штрих-кода
int cod_inp(void)
{
	int answer, count;
	char ch;
	do
	{
		clrscr();
		printf("Введите штрих-код: ");
		count = scanf_s("%d", &answer);
		while (ch = getchar() != '\n');
		if (answer <= 0)
			return answer;
	} while ((answer < 1000) || (answer >= 10000) || (count < 1));
	return answer;
}

//массив в число
int arr_to_int(short arr[4])
{
	int answer = 0;
	int n = 1000;
	for (int i = 0; i < 4; i++)
	{
		answer += arr[i] * n;
		n /= 10;
	}
	return answer;
}

//число в массив
short int_to_arr(int number)
{
	short answer_arr[4] = { 0 };
	for (int i = 3; i >= 0; i--)
	{
		answer_arr[i] = number % 10;
		number /= 10;
	}
	return answer_arr;
}

//напечатать чек
void make_check(void)
{
	int all_sum_without_sell = 0, all_sell_sum = 0, price, new_price, count = 1, sell = 5;
	clrscr();
	printf("Ваш список продуктов:\n");
	for (int i = 0; i < sizeof(check) / sizeof(check[0]); i++)
	{
		if (check[i] != 0)
		{
			sell = 950 - (check[i] - 1) * 25;
			price = check[i] * price_array[i];
			new_price = (sell * price) / 1000;
			printf("%d) %s: %d руб./шт * %d шт. | %d рублей\n", count++, tovar_array[i], price_array[i], check[i], price);
			all_sum_without_sell += price;
			all_sell_sum += price - new_price;
		}
	}
	printf("Итого сумма: %d руб.\n", all_sum_without_sell);
	printf("Итого скидка: %d руб.\n", all_sell_sum);
	printf("К оплате: %d руб.\n", all_sum_without_sell - all_sell_sum);
}

void main()
{
	system("chcp 1251");
	setlocale(LC_ALL, "Russian");
	clrscr();
	SetConsoleTitle("Электронная касса");

	int cod, index, count = 0;
	price_list();
	system("pause");
	do
	{
		clrscr();
		cod = cod_inp();
		if (cod > 0)
		{
			index = check_update(cod);
			print_info(index);
			if (index >= 0)
				check[index]++;
			else
			{
				printf("Not in cods\n");
				system("pause");
				continue;
			}
			system("pause");
			count++;
		}
		else
		{
			make_check();
			break;
		}
	} while (1);
	system("pause");
}
