#pragma once
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <locale.h>
#include <ctype.h>
#define PROD 40
	typedef struct {
	char * cods;
	char * name;
	float cost;
	short count;
	float price;
}product;
//список продуктов (completed)
product P[] = {
	"0401","Бекон варенокопченый 500гр   ", 449.90, 0, 0,
	"0402","Бекон сырокопченый 500гр     ", 429.90, 0, 0,
	"0403","Колбаса сырокопченая 1кг     ",389.90, 0, 0,
	"0404","Рис бурый в упаковке 1кг     ", 499.90, 0, 0,
	"0405","Рис круглозерный 1кг         ", 105.10, 0, 0,
	"0406","Рис длиннозерный 1кг         ",114.50, 0,0,
	"0407","Рис пропаренный 1кг          ",130.0,0,0,
	"0408","Картофель \"Деревенский\" 1кг",18.90,0,0,
	"0409","Картофель очищенный 1кг      ",45.90,0,0,
	"0501","Картофель для жарки 1кг      ",37.90,0,0,
	"0502","Горох желтый колотый 1кг     ",429.90,0,0,
	"0503","Кефир 3,2%% 1л.              ",135.90,0,0,
	"0504","Кефир обезжиренный 1л        ",153.10,0,0,
	"0504","Кофе в зернах 400гр          ",245.90,0,0,
	"0505","Кофе молотый 600гр           ",190.90,0,0,
	"0506","Кофе для турки 500гр         ",598.90,0,0,
	"0507","Кофе баварский 1кг           ",450.90,0,0,
	"0508","Кофе сирийский в зернах 1кг  ",370.90,0,0,
	"0509","Чай черный 50 пакетиков      ",149.90,0,0,
	"0601","Чай зеленый 50 пакетиков     ",180.90,0,0,
	"0602","Творожная масса 200гр        ",75.90,0,0,
	"0603","Творог жирность 9%%           ",90.90,0,0,
	"0604","Крупа манная 1кг             ",89.90,0,0,
	"0605","Крупа пшено 1кг              ",63.90,0,0,
	"0606","Крупа перловая 1кг           ",76.90,0,0,
	"0607","Макароны спагетти 450гр      ",75.90,0,0,
	"0608","Макароны ушки 400гр          ",68.50,0,0,
	"0609","Макароны перья 400гр         ",68.90,0,0,
	"0702","Макароны вермишель 400гр     ",72.50,0,0,
	"0703","Сахар песок белый 1кг        ",56.90,0,0,
	"0704","Сахар тростниковый 500гр     ",54.90,0,0,
	"0705","Мука хлебопекарная в/c 1кг   ",54.90,0,0,
	"0706","Мука блинная 1кг             ",67.50,0,0,
	"0707","Чечевица красная 300гр       ",149.90,0,0,
	"0708","Кукурузные хлопья 400гр      ",209.90,0,0,
	"0709","Паштет с грибами 250гр       ",119.90,0,0,
	"0801","Паштет печеночный 250гр      ",128.50,0,0,
	"info","Показ инфы",0,0,0,
	"exit","Выход из программы",0,0,0,
	"cheq","Вывод чека",0,0,0,
};
//инструктирование (completed)
void ShowHelp(new)
{
	if (new == 1) {
		system("cls");
		printf("\t\t\tДобро пожаловать в онлайн-кассу!\n");
		printf("\tПеред началом работы, пожалуйста, ознакомьтесь с инструкцией.\n");
		printf("\tВ данной программе вы формируете чек, вводя 4 символьный код.\n");
		printf("\tПосле ввода для Вас выводятся данные о введенном Вами товаре.\n");
		printf("\tПосле этого Вы сможете прочитать штрих-код следующего товара.\n");
		printf("\tКогда все товары будут внесены в чек, введите в строку \"stop\"\n");
		printf("\t\tСкидка на товары считается следующим образом:\n");
		printf("\t\tНачиная от 2 шт. за каждую последующую +5%% скидки\n");
		printf("\n\tЧтобы еще раз прочитать это сообщение, введите \"info\"\n\t");
		printf("\n\tЧтобы получить итоговый чек покупки, введите \"cheq\"\n\t");
		printf("\n\tЧтобы принудительно закончить работу, введите \"exit\"\n\n\t");
		system("pause");
	}
}
//формирование чека (completed)
void showCheque() {
	system("cls");
	int num = 1, discount;
	float SalePrice,Summ=0,SaleSumm=0;
	printf("\t\tТовар\t\t\tКоличество\tЦена\t\tСтоимость(без скидки)\tСтоимость(со скидкой)\n");
	for (int i = 0; i < PROD-3; i++) {
		if (P[i].count > 0) {
			P[i].price = P[i].count * P[i].cost;
			discount = 5 * (P[i].count - 1);
			if (P[i].count > 11)
				discount = 50;
			SalePrice = (P[i].price / 100) * (100 - discount);
			printf("%d)\t%s\t*%d шт.\t\t%.2f руб/шт\t %.2f руб.\t\t%.2f руб.\n",num,P[i].name,P[i].count,P[i].cost,P[i].price,SalePrice);
			SaleSumm = SaleSumm + SalePrice;
			Summ = Summ + P[i].price;
			num++;
		}
	}
	printf("\n\t\t\t\t\t\t\t\t\tСумма: %.2f рублей\n", Summ);
	printf("\t\t\t\t\t\t\t\t\tСкидка: %.2f рублей\n", Summ-SaleSumm);
	printf("\t\t\t\t\t\t\t\t\tИтого: %.2f рублей\n\n", SaleSumm);
	system("pause");
}
//вывод списка продуктов (completed)
void List(int a){
	if (a == 1) {
		system("cls");
		printf("\t\tСписок товаров:\n");
		printf("ШТРИХ\t\tНазвание\t\tЦена\n");
		for (int i = 0; i < PROD - 3; i++) {
			printf("%s\t%s\t%.2f руб/шт\n", P[i].cods, P[i].name, P[i].cost);
		}
		system("pause");
	}
}
//инфа о продукте (completed)
void GiveInfo(int numb) {
	int choose=0;
	do {
		system("cls");
		printf("\n\n\nВыбранный товар:\t\t%s\n", P[numb].name);
		printf("Цена:\t\t\t\t%.2f руб/кг\n", P[numb].cost);
		printf("Количество в чеке (без этого):\t\t%d\n", P[numb].count);
		printf("\nДобавить этот товар в чек? 1- да, 2 - нет: ");
		scanf_s("%d", &choose);
	} while (choose < 1 || choose>2);
	if (choose == 1) {
		P[numb].count = P[numb].count + 1;
		printf("\nТовар успешно добавлен в чек\n\n");
	}
	else {
		printf("\nПринято. Товар не будет внесен в чек.\n\n");
	}
	system("pause");
}
//формирование нового чека (completed)
void Restart() {
	for (int i = 0; i < PROD; i++) {
		P[i].count = 0;
	}
}
//получения кода товара через ввод (completed) 
int GetCode() {
	char c[]={0,0,0,0,0};
	char ch;
	int numb=-1;
	system("cls");
	printf("\n\n\nВведите штрих-код желаемого товара: ");
	fgets(c,5,stdin);
	for (int i = 0; i < PROD; i++) {
		int check = 0;
		for (int j = 0; j < 4; j++) {
			if (c[j]==P[i].cods[j]) {
				check++;
			}
		}
		if (check == 4) {
			numb = i;
			i = PROD;
		}
	}
	if (numb < 0) {
		printf("Введены некорректные данные\n");
		fflush(stdin);
		while ((ch = getchar()) != '\n');
		system("pause");
		GetCode();
	}
	else
		return numb;
}
